---
kind: method
id: M:Autodesk.Revit.DB.Analysis.SpatialFieldManager.RemoveSpatialFieldPrimitive(System.Int32)
source: html/d57b5bdf-1e8d-5b65-7e48-fd95c855454b.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldManager.RemoveSpatialFieldPrimitive Method

Removes analysis results primitive identified by the unique index

## Syntax (C#)
```csharp
public void RemoveSpatialFieldPrimitive(
	int idx
)
```

## Parameters
- **idx** (`System.Int32`) - Unique index identifying the primitive

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - idx refers to non-existent primitive